import { BadRequestException, Logger } from '@nestjs/common'
import { hash } from 'argon2'

import { Prisma, PrismaClient } from '../../../prisma/generated'

const prisma = new PrismaClient({
	transactionOptions: {
		maxWait: 5000,
		timeout: 10000,
		isolationLevel: Prisma.TransactionIsolationLevel.Serializable
	}
})

async function main() {
	try {
		Logger.log('Початок заповнення бази даних')

		await prisma.$transaction([
			prisma.user.deleteMany(),
			prisma.socialLink.deleteMany(),
			prisma.stream.deleteMany(),
			prisma.category.deleteMany()
		])

		const CATEGORIES = [
			{
				title: 'Minecraft',
				slug: 'minecraft',
				description:
					'Занурьтеся у безкрайній світ творчості та пригод у Minecraft! Ця категорія присвячена найпопулярнішій пісочниці, де ви можете будувати, досліджувати та виживати в унікальних світах. Слідкуйте за стрімами, надихайтеся креативними будівлями, беріть участь у спільних проєктах та діліться своїми досягненнями. Приєднуйтеся до спільноти, де фантазія не знає меж, і відкрийте для себе неймовірні можливості, які пропонує Minecraft!',
				thumbnailUrl: '/categories/minecraft.webp'
			},
			{
				title: 'Grand Theft Auto V',
				slug: 'grand-theft-auto-v',
				description:
					'Ласкаво просимо до кримінального світу Лос-Сантоса! Ця категорія присвячена одній із найпопулярніших ігор у відкритому світі, де ви можете вільно досліджувати, виконувати місії та насолоджуватися божевільними пригодами. Слідкуйте за стрімами, беріть участь у захоплюючих гонках та пограбуваннях, обговорюйте стратегії та діліться своїми унікальними моментами з гри. Приєднуйтеся до спільноти, де кожен знайде собі заняття — від вуличних гонок до створення власних історій у рамках GTA V!',
				thumbnailUrl: '/categories/grand-theft-auto-v.webp'
			},
			{
				title: 'Rust',
				slug: 'rust',
				description:
					'Ласкаво просимо до суворого та захоплюючого світу Rust! Ця категорія присвячена одній із найпопулярніших ігор на виживання, де стратегії та навички відіграють ключову роль. Слідкуйте за стрімами, спостерігайте за побудовою баз, захоплюючими боями та захопленнями ресурсів. Діліться своїми тактиками, обговорюйте оновлення та знаходьте однодумців, готових кинути виклик цьому жорстокому світу. Приєднуйтеся до нас, щоб навчитися виживати та процвітати в умовах жорсткої конкуренції!',
				thumbnailUrl: '/categories/rust.webp'
			},
			{
				title: 'Cyberpunk 2077',
				slug: 'cyberpunk-2077',
				description:
					'Ласкаво просимо до похмурого та захоплюючого світу Найт-Сіті! Ця категорія присвячена Cyberpunk 2077, де ви зможете зануритися в атмосферу майбутнього, повного технологій, пригод та складних виборів. Слідкуйте за стрімами, обговорюйте квести та сюжетні лінії, а також діліться своїми тактиками та досвідом у цій унікальній RPG. Приєднуйтеся до спільноти, де кожен може досліджувати світ кіберпанку та розкривати його таємниці, стаючи частиною цієї неймовірної історії!',
				thumbnailUrl: '/categories/cyberpunk-2077.webp'
			},
			{
				title: 'Спілкування',
				slug: 'just-chatting',
				description:
					'Занурюйтеся у світ живих дискусій та спілкування! Ця категорія пропонує вам унікальну можливість обмінюватися думками, брати участь у захоплюючих бесідах та знаходити однодумців. Діліться своїми думками, ставте запитання та отримуйте відповіді в реальному часі. Приєднуйтеся до стрімів, де кожен може висловити свою думку та стати частиною дружньої спільноти!',
				thumbnailUrl: '/categories/just-chatting.webp'
			},
			{
				title: 'Red Dead Redemption 2',
				slug: 'red-dead-redemption-2',
				description:
					'Занурьтеся в атмосферу Дикого Заходу з однією з найзахопливіших пригод в історії ігор! Ця категорія присвячена Red Dead Redemption 2, де ви зможете слідкувати за епічними історіями, досліджувати мальовничі ландшафти та брати участь у захоплюючих стрімах. Обговорюйте стратегії, діліться моментами з гри та знаходьте однодумців, які поділяють вашу пристрасть до цього культового твору. Приєднуйтеся до нас і відкрийте для себе світ, повний пригод, свободи та духу ковбойського життя!',
				thumbnailUrl: '/categories/red-dead-redemption-2.webp'
			},
			{
				title: 'Навчання',
				slug: 'learning',
				description:
					'Розширте свої знання та навички в цій категорії, присвяченій навчанню! Тут ви знайдете стріми та курси з різноманітних тем — від мистецтва та музики до мов та особистої продуктивності. Беріть участь в інтерактивних уроках, ставте запитання та отримуйте поради від досвідчених наставників. Навчання стало ще доступнішим та захопливішим! Приєднуйтеся до спільноти тих, хто прагне до самовдосконалення, та відкрийте нові горизонти для свого розвитку!',
				thumbnailUrl: '/categories/learning.webp'
			},
			{
				title: 'Fortnite',
				slug: 'fortnite',
				description:
					'Занурьтеся у яскравий та динамічний світ Fortnite! Ця категорія присвячена культовій грі, де будівництво, стратегія та битви з противниками поєднуються в одному захоплюючому процесі. Слідкуйте за стрімами, спостерігайте за матчами за участі найкращих гравців та вчіться у них унікальним тактикам. Діліться своїми досягненнями, обговорюйте нові оновлення та знаходьте однодумців для спільної гри. Приєднуйтеся до нашої спільноти та станьте частиною епічних битв на острові Fortnite!',
				thumbnailUrl: '/categories/fortnite.webp'
			},
			{
				title: 'Counter-Strike',
				slug: 'counter-strike',
				description:
					'Ласкаво просимо до світу напружених боїв та стратегічного геймплею! Ця категорія присвячена популярній грі Counter-Strike, де ви зможете спостерігати за захоплюючими матчами, вчитися у найкращих гравців та ділитися своїми тактиками. Приєднуйтеся до стрімів, обговорюйте останні оновлення та змагайтеся з іншими гравцями. Будьте в курсі найяскравіших моментів та станьте частиною захоплюючої кіберспортивної культури!',
				thumbnailUrl: '/categories/counter-strike.webp'
			},
			{
				title: 'Програмування',
				slug: 'programming',
				description:
					'Відкрийте для себе захоплюючий світ коду та технологій! Ця категорія присвячена програмуванню, де ви можете навчатися, ділитися досвідом та надихатися новими ідеями. Слідкуйте за стрімами, присвяченими різним мовам програмування, інструментам та розробці проєктів. Беріть участь в обговореннях, ставте запитання та отримуйте поради від досвідчених розробників. Приєднуйтеся до спільноти, де код стає мистецтвом, і кожний рядок — крок до вашого наступного досягнення!',
				thumbnailUrl: '/categories/programming.webp'
			},
			{
				title: 'Dota 2',
				slug: 'dota-2',
				description:
					'Занурьтеся у світ стратегічних битв та командної гри з Dota 2! Ця категорія призначена для всіх шанувальників культової MOBA, де ви зможете слідкувати за захоплюючими матчами, вивчати стратегії та ділитися досвідом з іншими гравцями. Приєднуйтеся до стрімів, обговорюйте останні оновлення та тактики, а також знаходьте однодумців для спільної гри. Відкрийте для себе захоплюючий світ героїв, навичок та командних боїв, де кожне рішення може змінити хід битви!',
				thumbnailUrl: '/categories/dota-2.webp'
			},
			{
				title: 'Brawl Stars',
				slug: 'brawl-stars',
				description:
					'Занурьтеся у динамічні битви та швидку тактику у світі Brawl Stars! Ця категорія створена для всіх фанатів захоплюючих битв 3 на 3 та епічних боїв у режимі "Королівська битва". Тут ви зможете дивитися найкращі стріми, обговорювати стратегії та розробляти нові тактики для своїх бійців. Приєднуйтеся до спільноти гравців, слідкуйте за останніми оновленнями, відкривайте нових персонажів та покращуйте їхні здібності. Кожний бій — це новий виклик, де командна робота та майстерність визначають переможця!',
				thumbnailUrl: '/categories/brawl-stars.webp'
			},
			{
				title: 'Clash Royale',
				slug: 'clash-royale',
				description:
					'Занурьтеся у захоплюючий світ Clash Royale, де стратегія та миттєві рішення визначають результат битв! Ця категорія призначена для всіх шанувальників карткових батлів, де ви зможете спостерігати за захоплюючими турнірами, вивчати успішні колоди та ділитися досвідом з іншими гравцями. Приєднуйтеся до стрімів, обговорюйте останні оновлення та тактики, відкривайте нові карти та покращуйте свої улюблені карти до максимуму. Досліджуйте нескінченні можливості для створення унікальних стратегій та змагайтеся з противниками, щоб стати майстром арени!',
				thumbnailUrl: '/categories/clash-royale.webp'
			},
			{
				title: 'Музика',
				slug: 'music',
				description:
					'Занурьтеся у світ музики, де кожен акорд і ритм наповнюють атмосферу натхненням та емоціями! Ця категорія призначена для всіх меломанів та музикантів, де ви зможете насолоджуватися живими виступами, відкривати нові жанри та ділитися своїм досвідом з однодумцями. Приєднуйтеся до стрімів, обговорюйте останні релізи та події музичної індустрії, а також діліться своїми творіннями та грою. Відкрийте для себе дивовижний світ звуків, де кожен виступ — це унікальна історія, яка чекає на свого слухача!',
				thumbnailUrl: '/categories/music.webp'
			},
			{
				title: 'Call of Duty',
				slug: 'call-of-duty',
				description:
					'Занурьтеся у світ захоплюючих військових операцій та командних битв з Call of Duty! Ця категорія створена для всіх фанатів легендарної франшизи, де ви зможете спостерігати за напруженими матчами, вивчати тактики та ділитися своїм досвідом з іншими гравцями. Приєднуйтеся до стрімів, обговорюйте останні оновлення та нововведення, а також знаходьте союзників для спільної гри в різних режимах. Досліджуйте динамічні карти, освоюйте унікальну зброю та тактики, де кожне ваше рішення може стати ключем до перемоги в цьому епічному бойовому світі!',
				thumbnailUrl: '/categories/call-of-duty.webp'
			},
			{
				title: 'World of Tanks',
				slug: 'world-of-tanks',
				description:
					'Занурьтеся у світ броньованих битв та стратегічної тактики з World of Tanks! Ця категорія призначена для всіх шанувальників легендарної танкової битви, де ви зможете спостерігати за захоплюючими матчами, вивчати особливості різних танків та ділитися досвідом з однодумцями. Приєднуйтеся до стрімів, обговорюйте останні оновлення та балансування, а також знаходьте товаришів по команді для спільної гри в різних режимах. Відкрийте для себе захоплюючі битви на різноманітних картах, покращуйте свою армію та розвивайте стратегічні навички, де кожне ваше рішення може змінити хід бою!',
				thumbnailUrl: '/categories/world-of-tanks.webp'
			},
			{
				title: 'League of Legends',
				slug: 'league-of-legends',
				description:
					'Занурьтеся у світ епічних битв та стратегічного геймплею з League of Legends! Ця категорія створена для всіх шанувальників культової MOBA, де ви зможете слідкувати за захоплюючими матчами, вивчати стратегії та ділитися досвідом з іншими гравцями. Приєднуйтеся до стрімів, обговорюйте останні оновлення та патчі, а також знаходьте однодумців для спільної гри. Відкрийте для себе безліч унікальних чемпіонів, досліджуйте їхні здібності та розвивайте свої навички, щоб стати майстром поля бою. Кожна гра — це новий виклик, де командна робота та вміння адаптуватися до ситуації визначають перемогу!',
				thumbnailUrl: '/categories/league-of-legends.webp'
			},
			{
				title: 'Спорт',
				slug: 'sport',
				description:
					'Занурьтеся у захоплюючий світ спорту, де пристрасть, змагання та дух командної гри зливаються воєдино! Ця категорія призначена для всіх шанувальників активного способу життя та спортивних подій, де ви зможете слідкувати за захоплюючими матчами, обговорювати стратегії команд та ділитися своїм досвідом з іншими фанатами. Приєднуйтеся до стрімів, слідкуйте за останніми новинами та результатами, а також знаходьте однодумців для спільних тренувань та обговорень. Відкрийте для себе дивовижний світ спорту, де кожне змагання — це можливість проявити свої сили та прагнення до перемоги!',
				thumbnailUrl: '/categories/sport.webp'
			}
		]

		await prisma.category.createMany({
			data: CATEGORIES
		})

		Logger.log('Категорії успішно створені')

		const categories = await prisma.category.findMany()

		const categoriesBySlug = Object.fromEntries(
			categories.map(category => [category.slug, category])
		)

		const STREAMS = {
			minecraft: [
				'Проходимо Minecraft: виживання з нуля!',
				'Будуємо епічні споруди в Minecraft',
				'Таємниці Майнкрафт: пригоди починаються!',
				'Створюємо ферму в Minecraft',
				'Вбиваємо Дракона Краю!',
				'Досліджуємо підземелля Minecraft',
				'Магічні зілля та чари в Minecraft',
				'Автоматизуємо видобуток ресурсів в Minecraft',
				'Рибальство та полювання в Minecraft: збираємо лут',
				'Крафтимо унікальні предмети в Minecraft'
			],
			'grand-theft-auto-v': [
				'Проходимо GTA 5 на 100%',
				'Гонки та трюки в GTA Online',
				'Сюжетка GTA 5: знову в справі!',
				'Пограбування в GTA V: робимо справу',
				'Веселимося в Лос-Сантосі',
				'Відкриваємо секретні локації в GTA 5',
				'Граємо в місії "Контракт" в GTA Online',
				'Місії проти поліції в GTA 5',
				'Огляд нових машин і тюнінгу в GTA Online',
				'Створюємо свій бізнес в Лос-Сантосі'
			],
			rust: [
				'Рейдимо бази в Rust',
				'Виживання в пустці: Rust',
				'Нові механіки Rust: тестуємо!',
				'Від новачка до про в Rust',
				'ПвП битви у світі Rust',
				'Готуємо рейди в Rust: тактики і стратегії',
				'Пастки та оборонні споруди в Rust',
				'Шукаємо рідкісні ресурси в Rust',
				'Досліджуємо величезні карти Rust',
				'Виживаємо в жорстких умовах Rust'
			],
			'cyberpunk-2077': [
				'Досліджуємо Найт-Сіті в Cyberpunk 2077',
				'Проходимо сюжетні квести Cyberpunk',
				'Моддінг і кастомізація в Cyberpunk',
				'Зброя та хаки: бойові тактики Cyberpunk',
				'Агентські місії у світі майбутнього',
				'Кіберімпланти: покращуємо персонажа',
				'Досліджуємо світ корпоративних змов',
				'Місії зі швидкими мережевими атаками',
				'Робимо побічні квести Cyberpunk 2077',
				'Огляд оновлень і доповнень до гри'
			],
			'just-chatting': [
				'Спілкуємося з підписниками!',
				'Відповіді на питання: запитуйте будь-які!',
				'Чілл-стрім: базікаємо про все',
				'Ваші історії, наші обговорення',
				'Затишні розмови та новини',
				'Обговорюємо останні фільми та серіали',
				'Музичні рекомендації від глядачів',
				'Ваші питання, наші відповіді!',
				'Міркуємо про майбутнє технологій',
				'Тренди в ігровій індустрії: обговорюємо'
			],
			'red-dead-redemption-2': [
				'Пригоди у світі Red Dead Redemption 2',
				'Проходимо сюжет RDR2: Дикий Захід кличе',
				'Полювання та виживання в RDR2',
				'Досліджуємо дикі землі RDR2',
				'Найкращі місії в Red Dead Redemption 2',
				'Рейдимо бандитські укриття в RDR2',
				'Подорожуємо світом Дикого Заходу',
				'Торгівля та видобуток ресурсів в RDR2',
				'Стаємо мисливцями за головами в RDR2',
				'Огляд легендарних звірів і трофеїв'
			],
			learning: [
				'Вивчаємо основи фотографії',
				'Як стати майстром ораторського мистецтва',
				'Занурюємося в мистецтво малювання',
				'Як правильно вчити іноземні мови',
				'Тайм-менеджмент для продуктивного життя',
				'Розбираємося в психології спілкування',
				'Основи гри на гітарі для початківців',
				"Техніки швидкого читання та запам'ятовування",
				'Вивчаємо основи кулінарії: готуємо разом',
				'Вчимо основи фінансової грамотності'
			],
			fortnite: [
				'Стрім по Fortnite: королівська битва!',
				'Секрети будівництва в Fortnite',
				'Найкращі тактики для перемоги в Fortnite',
				'Сезонні події в Fortnite: беремо участь!',
				'Граємо в дуо та сквади в Fortnite',
				'Відкриваємо нові скіни в Fortnite',
				'Як отримати перемогу в Fortnite',
				'Челленджі Fortnite: виконуємо!',
				'Огляд нового бойового пропуску Fortnite',
				'Тренуємося в будівництві та стрільбі'
			],
			'counter-strike': [
				'Герої Counter-Strike: стратегія і тактика',
				'Найкращі моменти в CS:GO',
				'Беремо участь в турнірах по CS:GO',
				'Огляд карт в Counter-Strike',
				'ПвП бої в Counter-Strike',
				'Зброя та амуніція в CS: вибираємо найкраще',
				'Тактики для перемоги в матчах CS:GO',
				'Змагальні ігри: вчимося перемагати',
				'Кіберспортивні команди: слідкуємо за матчами',
				'Беремо участь у тренувальних матчах CS:GO'
			],
			programming: [
				'Програмуємо на JavaScript: від простого до складного',
				'Розробка ігор на Python: крок за кроком',
				'Створення веб-додатків з React: практичний посібник',
				'Вчимося розробляти мобільні додатки',
				'Розбираємо алгоритми та структури даних',
				'Робота з API в сучасних додатках',
				'Тестування коду: що потрібно знати',
				'Автоматизація процесів розробки',
				'Секрети ефективного дебагу',
				'Огляд сучасних фреймворків для вебу'
			],
			'dota-2': [
				'Проходимо Dota 2: секрети перемоги',
				'Огляд героїв Dota 2: вибираємо свою стратегію',
				'Готуємося до турніру по Dota 2',
				'Аналіз найкращих матчів Dota 2',
				'Поради з покращення гри в Dota 2',
				'Герої підтримки: як правильно грати?',
				'Секрети макрогри в Dota 2',
				'Контроль карти та роумінг в Dota 2',
				'Граємо за керрі: виграємо матчі',
				'Секрети перемоги в командних боях'
			],
			'brawl-stars': [
				'Стрімимо Brawl Stars: найкращі бравлери!',
				'Поради з гри в Brawl Stars',
				'Беремо участь у подіях Brawl Stars',
				'Нові режими в Brawl Stars: тестуємо!',
				'Обговорюємо стратегії для Brawl Stars',
				'Як вибрати найкращого бравлера для кожного режиму',
				'Граємо дуо і командами в Brawl Stars',
				'Проходимо сезонні події в Brawl Stars',
				'Відкриваємо нові скіни та нагороди',
				'Секрети прокачування бравлерів'
			],
			'clash-royale': [
				'Битви в Clash Royale: стратегії та тактики',
				'Проходимо турніри Clash Royale',
				'Огляд карт в Clash Royale',
				'Досягаємо нових вершин в Clash Royale',
				'Секрети успішної гри в Clash Royale',
				'Створюємо колоди для перемог в Clash Royale',
				'Огляд нових карт і механік Clash Royale',
				'Найкращі моменти турнірів по Clash Royale',
				'Стрімимо кланові битви в Clash Royale',
				'Перемагаємо в дуелях і змаганнях'
			],
			music: [
				'Музичні новинки: обговорюємо хіти!',
				'Слухаємо та обговорюємо улюблені альбоми',
				'Обговорюємо музичні жанри: що слухати?',
				'Створюємо музику разом!',
				'Музичні челленджі: беріть участь!',
				'Огляд музичних інструментів: вибираємо свій',
				'Вивчаємо музичні тренди 2024 року',
				'Музичні реакції: слухаємо разом',
				'Чіл-аут стрім: слухаємо розслаблюючу музику',
				'Інтерактивний плейлист: вибирайте треки'
			],
			'call-of-duty': [
				'Готуємося до битви в Call of Duty',
				'Сюжетні місії Call of Duty: проходимо разом',
				'Найкращі моменти з Call of Duty',
				'Огляд нових карт в Call of Duty',
				'Мультиплеєр в Call of Duty: поради та тактики',
				'Створюємо клани і беремо участь у битвах в Call of Duty',
				'Налаштовуємо зброю для максимальної ефективності',
				'Секрети гри в Call of Duty: як бути лідером',
				'Проходимо режим зомбі в Call of Duty',
				'Огляд нового бойового пропуску Call of Duty'
			],
			'world-of-tanks': [
				'Битви в World of Tanks: тактики і стратегії',
				'Найкращі танки в World of Tanks',
				'Проходимо квести в World of Tanks',
				'Огляд оновлень в World of Tanks',
				'Стрімимо бої в World of Tanks',
				'ПвП битви: вчимося перемагати',
				'Створюємо свою команду для турнірів WoT',
				'Налаштування танків для кращої гри',
				'Відкриваємо рідкісні танки та досягнення',
				'Секрети захоплення ключових точок у боях'
			],
			'league-of-legends': [
				'Герої League of Legends: вивчаємо стратегії',
				'Огляд нових оновлень в LoL',
				'Змагаємося в League of Legends',
				'Поради щодо гри в League of Legends',
				'Турніри та чемпіонати League of Legends',
				'Граємо за підтримку: як бути найкращим?',
				'Секрети макрогри в League of Legends',
				'Найкраща тактика для командної гри в LoL',
				'Проходимо рангові ігри в League of Legends',
				'Огляд нових скінів та подій в League of Legends'
			],
			sport: [
				'Обговорюємо спортивні події: останні новини!',
				'Спортивні тренування: секрети успіху',
				'Найкращі моменти у світі спорту',
				'Спортивні челленджі: беріть участь!',
				'Огляд спортивних ігор та подій',
				'Підтримуємо себе у формі: поради та лайфхаки',
				'Секрети успішних спортсменів: що важливо знати?',
				'Обговорюємо тактики і стратегії для командних видів спорту',
				'Реакції на останні спортивні трансляції',
				'Беремо участь у спортивних турнірах і змаганнях'
			]
		}

		const USERNAMES = [
			'keytostream',
			'evelone2004',
			'alex',
			'bella',
			'carter',
			'dylan',
			'ethan',
			'fiona',
			'grace',
			'henry',
			'isabella',
			'jackson',
			'kate',
			'liam',
			'mia',
			'noah',
			'oliver',
			'paige',
			'quinn',
			'ryan',
			'sophia',
			'thomas',
			'ursula',
			'victor',
			'willow',
			'xander',
			'yara',
			'zoe',
			'adrian',
			'bella',
			'caroline',
			'daniel',
			'elena',
			'felix',
			'gabriel',
			'hannah',
			'ian',
			'julia',
			'kevin',
			'lily',
			'michael',
			'nina',
			'oscar',
			'peter',
			'quincy',
			'rachel',
			'samuel',
			'taylor',
			'ulysses',
			'vanessa',
			'wyatt',
			'xenia',
			'yuri',
			'zoey',
			'amelia',
			'benjamin',
			'charlotte',
			'david',
			'emma',
			'frederick',
			'georgia',
			'harper',
			'isaac',
			'joseph',
			'katie',
			'lucas',
			'madison',
			'nathan',
			'olivia',
			'patrick',
			'quincy',
			'rebecca',
			'sebastian',
			'tiffany',
			'ulyana',
			'victoria',
			'wesley',
			'xavier',
			'yasmin',
			'zoella',
			'aaron',
			'brianna',
			'claire',
			'diego',
			'ella',
			'frank',
			'george',
			'holly',
			'ivan',
			'jessica',
			'kyle',
			'logan',
			'mason',
			'nicolas',
			'olga',
			'paul',
			'quinn',
			'ryder',
			'scarlett',
			'tristan',
			'ulysses',
			'violet'
		]

		await prisma.$transaction(async tx => {
			for (const username of USERNAMES) {
				const randomCategory =
					categoriesBySlug[
						Object.keys(categoriesBySlug)[
							Math.floor(
								Math.random() *
									Object.keys(categoriesBySlug).length
							)
						]
					]

				const userExists = await tx.user.findUnique({
					where: {
						username
					}
				})

				if (!userExists) {
					const createdUser = await tx.user.create({
						data: {
							email: `${username}@gmail.com`,
							password: await hash('12345678'),
							username,
							displayName: username,
							avatar: `/channels/${username}.webp`,
							isEmailVerified: true,
							socialLinks: {
								createMany: {
									data: [
										{
											title: 'Telegram',
											url: `https://t.me/${username}`,
											position: 1
										},
										{
											title: 'YouTube',
											url: `https://youtube.com/@${username}`,
											position: 2
										}
									]
								}
							}
						}
					})

					const randomTitles = STREAMS[randomCategory.slug]
					const randomTitle =
						randomTitles[
							Math.floor(Math.random() * randomTitles.length)
						]

					await tx.stream.create({
						data: {
							title: randomTitle,
							thumbnailUrl: `/streams/${createdUser.username}.webp`,
							user: {
								connect: {
									id: createdUser.id
								}
							},
							category: {
								connect: {
									id: randomCategory.id
								}
							}
						}
					})

					Logger.log(
						`Користувач "${createdUser.username}" і його стрім, успішно створені`
					)
				}
			}
		})

		Logger.log('Заповнення бази даних успішно завершено')
	} catch (error) {
		Logger.error(error)
		throw new BadRequestException('Помилка при заповненні бази даних')
	} finally {
		Logger.log("Закриття з'єдання з базою даних...")
		await prisma.$disconnect()
		Logger.log('Закриття з базою даних, успішно закрито')
	}
}

main()
