export const CATEGORIES = [
	{
		title: 'Minecraft',
		slug: 'minecraft',
		description:
			'Занурьтеся у безкрайній світ творчості та пригод у Minecraft! Ця категорія присвячена найпопулярнішій пісочниці, де ви можете будувати, досліджувати та виживати в унікальних світах. Слідкуйте за стрімами, надихайтеся креативними будівлями, беріть участь у спільних проєктах та діліться своїми досягненнями. Приєднуйтеся до спільноти, де фантазія не знає меж, і відкрийте для себе неймовірні можливості, які пропонує Minecraft!',
		thumbnailUrl: '/categories/minecraft.webp'
	},
	{
		title: 'Grand Theft Auto V',
		slug: 'grand-theft-auto-v',
		description:
			'Ласкаво просимо до кримінального світу Лос-Сантоса! Ця категорія присвячена одній із найпопулярніших ігор у відкритому світі, де ви можете вільно досліджувати, виконувати місії та насолоджуватися божевільними пригодами. Слідкуйте за стрімами, беріть участь у захоплюючих гонках та пограбуваннях, обговорюйте стратегії та діліться своїми унікальними моментами з гри. Приєднуйтеся до спільноти, де кожен знайде собі заняття — від вуличних гонок до створення власних історій у рамках GTA V!',
		thumbnailUrl: '/categories/grand-theft-auto-v.webp'
	},
	{
		title: 'Rust',
		slug: 'rust',
		description:
			'Ласкаво просимо до суворого та захоплюючого світу Rust! Ця категорія присвячена одній із найпопулярніших ігор на виживання, де стратегії та навички відіграють ключову роль. Слідкуйте за стрімами, спостерігайте за побудовою баз, захоплюючими боями та захопленнями ресурсів. Діліться своїми тактиками, обговорюйте оновлення та знаходьте однодумців, готових кинути виклик цьому жорстокому світу. Приєднуйтеся до нас, щоб навчитися виживати та процвітати в умовах жорсткої конкуренції!',
		thumbnailUrl: '/categories/rust.webp'
	},
	{
		title: 'Cyberpunk 2077',
		slug: 'cyberpunk-2077',
		description:
			'Ласкаво просимо до похмурого та захоплюючого світу Найт-Сіті! Ця категорія присвячена Cyberpunk 2077, де ви зможете зануритися в атмосферу майбутнього, повного технологій, пригод та складних виборів. Слідкуйте за стрімами, обговорюйте квести та сюжетні лінії, а також діліться своїми тактиками та досвідом у цій унікальній RPG. Приєднуйтеся до спільноти, де кожен може досліджувати світ кіберпанку та розкривати його таємниці, стаючи частиною цієї неймовірної історії!',
		thumbnailUrl: '/categories/cyberpunk-2077.webp'
	},
	{
		title: 'Спілкування',
		slug: 'just-chatting',
		description:
			'Занурюйтеся у світ живих дискусій та спілкування! Ця категорія пропонує вам унікальну можливість обмінюватися думками, брати участь у захоплюючих бесідах та знаходити однодумців. Діліться своїми думками, ставте запитання та отримуйте відповіді в реальному часі. Приєднуйтеся до стрімів, де кожен може висловити свою думку та стати частиною дружньої спільноти!',
		thumbnailUrl: '/categories/just-chatting.webp'
	},
	{
		title: 'Red Dead Redemption 2',
		slug: 'red-dead-redemption-2',
		description:
			'Занурьтеся в атмосферу Дикого Заходу з однією з найзахопливіших пригод в історії ігор! Ця категорія присвячена Red Dead Redemption 2, де ви зможете слідкувати за епічними історіями, досліджувати мальовничі ландшафти та брати участь у захоплюючих стрімах. Обговорюйте стратегії, діліться моментами з гри та знаходьте однодумців, які поділяють вашу пристрасть до цього культового твору. Приєднуйтеся до нас і відкрийте для себе світ, повний пригод, свободи та духу ковбойського життя!',
		thumbnailUrl: '/categories/red-dead-redemption-2.webp'
	},
	{
		title: 'Навчання',
		slug: 'learning',
		description:
			'Розширте свої знання та навички в цій категорії, присвяченій навчанню! Тут ви знайдете стріми та курси з різноманітних тем — від мистецтва та музики до мов та особистої продуктивності. Беріть участь в інтерактивних уроках, ставте запитання та отримуйте поради від досвідчених наставників. Навчання стало ще доступнішим та захопливішим! Приєднуйтеся до спільноти тих, хто прагне до самовдосконалення, та відкрийте нові горизонти для свого розвитку!',
		thumbnailUrl: '/categories/learning.webp'
	},
	{
		title: 'Fortnite',
		slug: 'fortnite',
		description:
			'Занурьтеся у яскравий та динамічний світ Fortnite! Ця категорія присвячена культовій грі, де будівництво, стратегія та битви з противниками поєднуються в одному захоплюючому процесі. Слідкуйте за стрімами, спостерігайте за матчами за участі найкращих гравців та вчіться у них унікальним тактикам. Діліться своїми досягненнями, обговорюйте нові оновлення та знаходьте однодумців для спільної гри. Приєднуйтеся до нашої спільноти та станьте частиною епічних битв на острові Fortnite!',
		thumbnailUrl: '/categories/fortnite.webp'
	},
	{
		title: 'Counter-Strike',
		slug: 'counter-strike',
		description:
			'Ласкаво просимо до світу напружених боїв та стратегічного геймплею! Ця категорія присвячена популярній грі Counter-Strike, де ви зможете спостерігати за захоплюючими матчами, вчитися у найкращих гравців та ділитися своїми тактиками. Приєднуйтеся до стрімів, обговорюйте останні оновлення та змагайтеся з іншими гравцями. Будьте в курсі найяскравіших моментів та станьте частиною захоплюючої кіберспортивної культури!',
		thumbnailUrl: '/categories/counter-strike.webp'
	},
	{
		title: 'Програмування',
		slug: 'programming',
		description:
			'Відкрийте для себе захоплюючий світ коду та технологій! Ця категорія присвячена програмуванню, де ви можете навчатися, ділитися досвідом та надихатися новими ідеями. Слідкуйте за стрімами, присвяченими різним мовам програмування, інструментам та розробці проєктів. Беріть участь в обговореннях, ставте запитання та отримуйте поради від досвідчених розробників. Приєднуйтеся до спільноти, де код стає мистецтвом, і кожний рядок — крок до вашого наступного досягнення!',
		thumbnailUrl: '/categories/programming.webp'
	},
	{
		title: 'Dota 2',
		slug: 'dota-2',
		description:
			'Занурьтеся у світ стратегічних битв та командної гри з Dota 2! Ця категорія призначена для всіх шанувальників культової MOBA, де ви зможете слідкувати за захоплюючими матчами, вивчати стратегії та ділитися досвідом з іншими гравцями. Приєднуйтеся до стрімів, обговорюйте останні оновлення та тактики, а також знаходьте однодумців для спільної гри. Відкрийте для себе захоплюючий світ героїв, навичок та командних боїв, де кожне рішення може змінити хід битви!',
		thumbnailUrl: '/categories/dota-2.webp'
	},
	{
		title: 'Brawl Stars',
		slug: 'brawl-stars',
		description:
			'Занурьтеся у динамічні битви та швидку тактику у світі Brawl Stars! Ця категорія створена для всіх фанатів захоплюючих битв 3 на 3 та епічних боїв у режимі "Королівська битва". Тут ви зможете дивитися найкращі стріми, обговорювати стратегії та розробляти нові тактики для своїх бійців. Приєднуйтеся до спільноти гравців, слідкуйте за останніми оновленнями, відкривайте нових персонажів та покращуйте їхні здібності. Кожний бій — це новий виклик, де командна робота та майстерність визначають переможця!',
		thumbnailUrl: '/categories/brawl-stars.webp'
	},
	{
		title: 'Clash Royale',
		slug: 'clash-royale',
		description:
			'Занурьтеся у захоплюючий світ Clash Royale, де стратегія та миттєві рішення визначають результат битв! Ця категорія призначена для всіх шанувальників карткових батлів, де ви зможете спостерігати за захоплюючими турнірами, вивчати успішні колоди та ділитися досвідом з іншими гравцями. Приєднуйтеся до стрімів, обговорюйте останні оновлення та тактики, відкривайте нові карти та покращуйте свої улюблені карти до максимуму. Досліджуйте нескінченні можливості для створення унікальних стратегій та змагайтеся з противниками, щоб стати майстром арени!',
		thumbnailUrl: '/categories/clash-royale.webp'
	},
	{
		title: 'Музика',
		slug: 'music',
		description:
			'Занурьтеся у світ музики, де кожен акорд і ритм наповнюють атмосферу натхненням та емоціями! Ця категорія призначена для всіх меломанів та музикантів, де ви зможете насолоджуватися живими виступами, відкривати нові жанри та ділитися своїм досвідом з однодумцями. Приєднуйтеся до стрімів, обговорюйте останні релізи та події музичної індустрії, а також діліться своїми творіннями та грою. Відкрийте для себе дивовижний світ звуків, де кожен виступ — це унікальна історія, яка чекає на свого слухача!',
		thumbnailUrl: '/categories/music.webp'
	},
	{
		title: 'Call of Duty',
		slug: 'call-of-duty',
		description:
			'Занурьтеся у світ захоплюючих військових операцій та командних битв з Call of Duty! Ця категорія створена для всіх фанатів легендарної франшизи, де ви зможете спостерігати за напруженими матчами, вивчати тактики та ділитися своїм досвідом з іншими гравцями. Приєднуйтеся до стрімів, обговорюйте останні оновлення та нововведення, а також знаходьте союзників для спільної гри в різних режимах. Досліджуйте динамічні карти, освоюйте унікальну зброю та тактики, де кожне ваше рішення може стати ключем до перемоги в цьому епічному бойовому світі!',
		thumbnailUrl: '/categories/call-of-duty.webp'
	},
	{
		title: 'World of Tanks',
		slug: 'world-of-tanks',
		description:
			'Занурьтеся у світ броньованих битв та стратегічної тактики з World of Tanks! Ця категорія призначена для всіх шанувальників легендарної танкової битви, де ви зможете спостерігати за захоплюючими матчами, вивчати особливості різних танків та ділитися досвідом з однодумцями. Приєднуйтеся до стрімів, обговорюйте останні оновлення та балансування, а також знаходьте товаришів по команді для спільної гри в різних режимах. Відкрийте для себе захоплюючі битви на різноманітних картах, покращуйте свою армію та розвивайте стратегічні навички, де кожне ваше рішення може змінити хід бою!',
		thumbnailUrl: '/categories/world-of-tanks.webp'
	},
	{
		title: 'League of Legends',
		slug: 'league-of-legends',
		description:
			'Занурьтеся у світ епічних битв та стратегічного геймплею з League of Legends! Ця категорія створена для всіх шанувальників культової MOBA, де ви зможете слідкувати за захоплюючими матчами, вивчати стратегії та ділитися досвідом з іншими гравцями. Приєднуйтеся до стрімів, обговорюйте останні оновлення та патчі, а також знаходьте однодумців для спільної гри. Відкрийте для себе безліч унікальних чемпіонів, досліджуйте їхні здібності та розвивайте свої навички, щоб стати майстром поля бою. Кожна гра — це новий виклик, де командна робота та вміння адаптуватися до ситуації визначають перемогу!',
		thumbnailUrl: '/categories/league-of-legends.webp'
	},
	{
		title: 'Спорт',
		slug: 'sport',
		description:
			'Занурьтеся у захоплюючий світ спорту, де пристрасть, змагання та дух командної гри зливаються воєдино! Ця категорія призначена для всіх шанувальників активного способу життя та спортивних подій, де ви зможете слідкувати за захоплюючими матчами, обговорювати стратегії команд та ділитися своїм досвідом з іншими фанатами. Приєднуйтеся до стрімів, слідкуйте за останніми новинами та результатами, а також знаходьте однодумців для спільних тренувань та обговорень. Відкрийте для себе дивовижний світ спорту, де кожне змагання — це можливість проявити свої сили та прагнення до перемоги!',
		thumbnailUrl: '/categories/sport.webp'
	}
]
